<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of HOBOware and creates a package.</string>
	<key>Identifier</key>
	<string>edu.monmouth.im.autopkg.pkg.HOBOware</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>HOBOware</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>edu.monmouth.im.autopkg.download.HOBOware</string>
	<key>Process</key>
	<array>
		<dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>download_changed == True</string>
            </dict>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>info_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Package_contents/HOBOware.app/Contents/Info.plist</string>
			</dict>
			<key>Processor</key>
			<string>PlistReader</string>
		</dict>
	</array>
</dict>
</plist>
