<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of SF Symbols 4</string>
	<key>Identifier</key>
	<string>edu.monmouth.im.autopkg.pkg.SF Symbols 4</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SFSymbols4</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>edu.monmouth.im.autopkg.download.SF Symbols 4</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%</string>
            </dict>
		</dict>	
	</array>		
</dict>
</plist>
