<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of SF Symbols 4</string>
	<key>Identifier</key>
	<string>edu.monmouth.im.autopkg.download.SF Symbols 4</string>
	<key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SFSymbols4</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>(https://devimages-cdn\.apple\.com/design/resources/download/SF-Symbols-4\..*?dmg)</string>
                <key>url</key>
                <string>https://developer.apple.com/sf-symbols/</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/SF Symbols.pkg</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Software Update</string>
                    <string>Apple Software Update Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>