Comment: Recipe automatically generated from com.github.dataJAR-recipes.pkg.Azul Zulu OpenJDK 11 LTS by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.AzulZuluOpenJDK11LTS
ParentRecipe: com.github.dataJAR-recipes.pkg.Azul Zulu OpenJDK 11 LTS
MinimumVersion: '2.3'

Input:
  NAME: AzulZuluOpenJDK11LTS
  CATEGORY: Applications
  GROUP_NAME: '%NAME%-update-smart'
  GROUP_TEMPLATE: JamfSmartGroupTemplate.xml
  TESTING_GROUP_NAME: Testing
  POLICY_CATEGORY: Testing
  POLICY_NAME: Install Latest %NAME%
  POLICY_TEMPLATE: JamfPolicyTemplate.xml
  SELF_SERVICE_DISPLAY_NAME: Install Latest %NAME%
  SELF_SERVICE_DESCRIPTION: 'Built by Java leaders, Azul Platform Core provides 100% open source, fully tested and certified, Java SE standards-compliant, well-curated builds of OpenJDK.'
  SELF_SERVICE_ICON: '%NAME%.png'
  UPDATE_PREDICATE: pkg_uploaded == True

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

- Processor: StopProcessingIf
  Arguments:
    predicate: '%UPDATE_PREDICATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%GROUP_NAME%'
    computergroup_template: '%GROUP_TEMPLATE%'
    replace_group: 'True'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    icon: '%SELF_SERVICE_ICON%'
    policy_name: '%POLICY_NAME%'
    policy_template: '%POLICY_TEMPLATE%'
    replace_policy: 'True'
