<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.jss.Android Studio Arm</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Android Developer</string>
		<key>GROUP_NAME</key>
		<string>#DEP -- FASM, Intel Chip Architecture excluded</string>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroupTemplate.xml</string>
		<key>NAME</key>
		<string>Android Studio Arm</string>
		<key>POLICY_CATEGORY</key>
		<string>Android Developer</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplateSelfService.xml</string>
		<key>POLICY_TRIGGER</key>
		<string>InstallAndroidArm</string>
		<key>SEARCH_PATTERN</key>
		<string>(https\://redirector\.gvt1\.com/edgedl/android/studio/install/.+/android-studio.+\_arm.dmg)</string>
		<key>SEARCH_URL</key>
		<string>https://developer.android.com/studio</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Install the latest version of %NAME%.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>Android Studio.png</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.novaksam.jss.AndroidStudio</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>com.github.autopkg.novaksam-recipes.Processors/MinimumOSExtractor</key>
			<dict>
				<key>git_hash</key>
				<string>a6d8a60fd9ee8abf1a331ebb9d220d50fc2f284c</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.novaksam-recipes/Processors/MinimumOSExtractor.py</string>
				<key>sha256_hash</key>
				<string>4df6bf8295979ef8f9fc3d6c22596e5418e06a1d1957910e9f7aeb60728aa251</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.novaksam.download.AndroidStudio</key>
			<dict>
				<key>git_hash</key>
				<string>de7d102f6fb22428561449050339617fae5822d1</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.novaksam-recipes/Recipes - Download/AndroidStudio.download.recipe</string>
				<key>sha256_hash</key>
				<string>8b81a2d8eae6e8dc0f20523fbc1e5c903e3688c4a93178451525a86d30ca3d4a</string>
			</dict>
			<key>com.github.novaksam.jss.AndroidStudio</key>
			<dict>
				<key>git_hash</key>
				<string>eba3d0160acb4e5d6e2c4fc5c36d236fbc412e11</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.novaksam-recipes/Android Studio/Android Studio.jss.recipe</string>
				<key>sha256_hash</key>
				<string>7060e5d6223862c18381e2465ebb81867dede7d45837abbd6010ae7a2fc7a923</string>
			</dict>
			<key>com.github.novaksam.pkg.AndroidStudio</key>
			<dict>
				<key>git_hash</key>
				<string>317410696a2577136f9b2d05d28e22f864bd3727</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.novaksam-recipes/Recipes - pkg/AndroidStudio.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>025e9526bfd7005bfb5c6ab0fdbc51eeb83ea08dec25d27ca5bf2c8bb78adcf1</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
