<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.jss.MicrosoftEdge</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Apps</string>
		<key>DESCRIPTION</key>
		<string>Microsoft Edge is a web browser developed by Microsoft.</string>
		<key>DOWNLOADURL</key>
		<string>https://go.microsoft.com/fwlink/?linkid=%PRODUCTID%</string>
		<key>GROUP_NAME</key>
		<string>Update-Smart-%NAME%</string>
		<key>GROUP_TEMPLATE</key>
		<string>%RECIPE_DIR%/SmartGroupTemplate.xml</string>
		<key>ICON</key>
		<string>%RECIPE_DIR%/MicrosoftEdge.png</string>
		<key>NAME</key>
		<string>Microsoft Edge</string>
		<key>POLICY_CATEGORY</key>
		<string>Testing</string>
		<key>POLICY_TEMPLATE</key>
		<string>%RECIPE_DIR%/PolicyTemplate.xml</string>
		<key>PRODUCTID</key>
		<string>2093504</string>
		<key>SOFTWARETITLE</key>
		<string>Edge</string>
		<key>VENDOR</key>
		<string>Microsoft</string>
		<key>VERSIONTYPE</key>
		<string>CFBundleShortVersionString</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.rtrouton.jss.microsoftedge</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.rtrouton.download.microsoftedge</key>
			<dict>
				<key>git_hash</key>
				<string>94bb3b9cbe49eca82aafd75665bf944f26438532</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/MicrosoftEdge/MicrosoftEdge.download.recipe</string>
				<key>sha256_hash</key>
				<string>77766bae33daee294ca3471d4959b5d88d94baf55f83a22d5c75318dddd8e69a</string>
			</dict>
			<key>com.github.rtrouton.jss.microsoftedge</key>
			<dict>
				<key>git_hash</key>
				<string>7616f15fc53f80a0455b007625e8edd6194d8efd</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/JSS/MicrosoftEdge.jss.recipe</string>
				<key>sha256_hash</key>
				<string>04f92f0d5596d098df42d2ca0e1eddd3c17a3b77ef5435bbfd1fc0b3f09ec1d8</string>
			</dict>
			<key>com.github.rtrouton.pkg.microsoftedge</key>
			<dict>
				<key>git_hash</key>
				<string>90f11cb9012473899a2640d445553ebbe86882a6</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/MicrosoftEdge/MicrosoftEdge.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>e8c3b024a22b7e2af0e8bba1aaac2d92dfab30c3c76a6b0d50295cf289ffd183</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
