<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.jamf.OBS</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Productivity</string>
		<key>GROUP_NAME</key>
		<string>OBS-update-smart</string>
		<key>GROUP_TEMPLATE</key>
		<string>JamfSmartGroupTemplate.xml</string>
		<key>NAME</key>
		<string>OBS</string>
		<key>POLICY_CATEGORY</key>
		<string>Productivity</string>
		<key>POLICY_NAME</key>
		<string>Install Latest %NAME%</string>
		<key>POLICY_TEMPLATE</key>
		<string>JamfPolicyTemplate.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Video recording and live streaming.</string>
		<key>SELF_SERVICE_DISPLAY_NAME</key>
		<string>Install Latest %NAME%</string>
		<key>SELF_SERVICE_ICON</key>
		<string>%NAME%.png</string>
		<key>TESTING_GROUP_NAME</key>
		<string>Testing</string>
		<key>UPDATE_PREDICATE</key>
		<string>pkg_uploaded == False</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.grahampugh-recipes.jamf.OBS</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</key>
			<dict>
				<key>git_hash</key>
				<string>d1834bfeeba8ff3a9cef947cbbabcf201e65d29b</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfCategoryUploader.py</string>
				<key>sha256_hash</key>
				<string>aee1da382397eef4afe2e9099035ad6420063c628c6711d8b1f0dc08ec5fcf2c</string>
			</dict>
			<key>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</key>
			<dict>
				<key>git_hash</key>
				<string>d1834bfeeba8ff3a9cef947cbbabcf201e65d29b</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfComputerGroupUploader.py</string>
				<key>sha256_hash</key>
				<string>5d0489fd9e664bc80563ba3f74df242746ccd6641985381ab1b2ad310aa373d0</string>
			</dict>
			<key>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</key>
			<dict>
				<key>git_hash</key>
				<string>d1834bfeeba8ff3a9cef947cbbabcf201e65d29b</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageUploader.py</string>
				<key>sha256_hash</key>
				<string>e3ca359fe843365a34e5dc542b17d3ad7d57e50a57f2fc36ba0fd43638748d89</string>
			</dict>
			<key>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</key>
			<dict>
				<key>git_hash</key>
				<string>1a4a757f904d39499e93f4a36a3dfa26500b6ae0</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPolicyUploader.py</string>
				<key>sha256_hash</key>
				<string>870fb35ce8b024bb14140f896ac7096f3fbc3a7365a5d42d651d66fb57f5ba2c</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.autopkg.grahampugh-recipes.jamf.OBS</key>
			<dict>
				<key>git_hash</key>
				<string>102a3d7cb8c841a10eb2233698c375d2f94519bc</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.joebembry.recipes/OBS/OBS.jamf.recipe</string>
				<key>sha256_hash</key>
				<string>26076f166f12099ad6a9247260d348ae89eb1799e69ffa8e3d1afbe91e16f218</string>
			</dict>
			<key>edu.monmouth.im.autopkg.download.OBS</key>
			<dict>
				<key>git_hash</key>
				<string>94c9741057cdf9d53996881c6d3eb030505775b9</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.joebembry.recipes/OBS/OBS.download.recipe</string>
				<key>sha256_hash</key>
				<string>d7df2265b6582206eb3d250a5109d54b7f0e811e985862c6264848c38d3f4a16</string>
			</dict>
			<key>edu.monmouth.im.autopkg.pkg.OBS</key>
			<dict>
				<key>git_hash</key>
				<string>94c9741057cdf9d53996881c6d3eb030505775b9</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.joebembry.recipes/OBS/OBS.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>1bb346cde6480fa7ce6e29a5098a9eba0b8d4ddb8afdc5afeb07b3b864d9ed5c</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
