<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.jss.Suspicious Package</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Utilities</string>
		<key>GROUP_NAME</key>
		<string>%NAME%-update-smart</string>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroupTemplate.xml</string>
		<key>NAME</key>
		<string>Suspicious Package</string>
		<key>POLICY_CATEGORY</key>
		<string>Testing</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>POLICY_TRIGGER</key>
		<string>Install_SuspiciousPackage</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Install the latest version of %NAME%.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>Suspicious Package.png</string>
		<key>pkg_url</key>
		<string>https://www.mothersruin.com/software/downloads/SuspiciousPackage.dmg</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.novaksam.jss.SuspiciousPackage</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.novaksam.download.SuspiciousPackage</key>
			<dict>
				<key>git_hash</key>
				<string>fc28d0fd2bdb6d95c1a86f011e4b7f401033ab70</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.novaksam-recipes/Recipes - Download/SuspiciousPackage.download.recipe</string>
				<key>sha256_hash</key>
				<string>88e8a9692d13a5080821187efe41b24c1765f7167f70f8257468617a2b65886f</string>
			</dict>
			<key>com.github.novaksam.jss.SuspiciousPackage</key>
			<dict>
				<key>git_hash</key>
				<string>6a093011429d47b5c63e7583125670a494330797</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.novaksam-recipes/Suspicious Package/Suspicious Package.jss.recipe</string>
				<key>sha256_hash</key>
				<string>1e2cc4f00b5aef9b9d9dc2780ed9c24803e600e310b2456dc1b0dc159fb0f93d</string>
			</dict>
			<key>com.github.novaksam.pkg.SuspiciousPackage</key>
			<dict>
				<key>git_hash</key>
				<string>58dca089b34efecaa415cb269d6c660fca2884c9</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.novaksam-recipes/Recipes - pkg/SuspiciousPackage.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>58da5222f89ac72ed270860625a6d4b55481f5b728d93f2bcb7783a17f11e27e</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
