<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.jss.Wireshark</string>
	<key>Input</key>
	<dict>
		<key>ARCH</key>
		<string>Intel</string>
		<key>CATEGORY</key>
		<string>Utilities</string>
		<key>GROUP_NAME</key>
		<string>%NAME%-update-smart</string>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroupTemplate.xml</string>
		<key>NAME</key>
		<string>Wireshark</string>
		<key>POLICY_CATEGORY</key>
		<string>Testing</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>POLICY_TRIGGER</key>
		<string>Install_Wireshark</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Install the latest version of %NAME%.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>Wireshark.png</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.novaksam.jss.Wireshark</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.homebysix.download.Wireshark</key>
			<dict>
				<key>git_hash</key>
				<string>cc40cefadb28f2fe39e7e4d05dc1b12240cbaa38</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/Wireshark/Wireshark.download.recipe</string>
				<key>sha256_hash</key>
				<string>5fe823560892b8aba50f64860a7812d323e8cfaf5f3fe7b699f0d89b03f09eb9</string>
			</dict>
			<key>com.github.homebysix.pkg.Wireshark</key>
			<dict>
				<key>git_hash</key>
				<string>cc40cefadb28f2fe39e7e4d05dc1b12240cbaa38</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/Wireshark/Wireshark.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>c476148004b118107965f1685a95f52f6bfc7262b2aa5ced76214838635a7f63</string>
			</dict>
			<key>com.github.novaksam.jss.Wireshark</key>
			<dict>
				<key>git_hash</key>
				<string>1af9100eab8946add8ca8300e60bd1384261a70c</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.novaksam-recipes/Wireshark/Wireshark.jss.recipe</string>
				<key>sha256_hash</key>
				<string>d81df7cc5698ff0dedb878f1f259a5306b48a7407ad72f81b89178c98d5e1feb</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
