<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.jamf.Zoom</string>
	<key>Input</key>
	<dict>
		<key>APPLICATION_NAME</key>
		<string>zoom.us.app</string>
		<key>BUNDLE_ID</key>
		<string>us.zoom.xos</string>
		<key>CATEGORY</key>
		<string>Productivity</string>
		<key>DOWNLOAD_URL</key>
		<string>https://zoom.us/client/latest/ZoomInstallerIT.pkg</string>
		<key>GROUP_NAME</key>
		<string>%NAME%-update-smart</string>
		<key>GROUP_TEMPLATE</key>
		<string>JamfSmartGroupTemplate.xml</string>
		<key>NAME</key>
		<string>Zoom</string>
		<key>POLICY_CATEGORY</key>
		<string>Testing</string>
		<key>POLICY_NAME</key>
		<string>Install Latest %NAME%</string>
		<key>POLICY_TEMPLATE</key>
		<string>JamfPolicyTemplate.xml</string>
		<key>POLICY_TRIGGER</key>
		<string>Install_Zoom</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>The Zoom app provides cloud-hosted video conferencing, plus online meetings and group messaging.</string>
		<key>SELF_SERVICE_DISPLAY_NAME</key>
		<string>Install Latest %NAME%</string>
		<key>SELF_SERVICE_ICON</key>
		<string>%NAME%.png</string>
		<key>TESTING_GROUP_NAME</key>
		<string>Testing</string>
		<key>UPDATE_PREDICATE</key>
		<string>pkg_uploaded == False</string>
		<key>USER_AGENT</key>
		<string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.novaksam.jamf.Zoom</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</key>
			<dict>
				<key>git_hash</key>
				<string>d1834bfeeba8ff3a9cef947cbbabcf201e65d29b</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfCategoryUploader.py</string>
				<key>sha256_hash</key>
				<string>aee1da382397eef4afe2e9099035ad6420063c628c6711d8b1f0dc08ec5fcf2c</string>
			</dict>
			<key>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</key>
			<dict>
				<key>git_hash</key>
				<string>d1834bfeeba8ff3a9cef947cbbabcf201e65d29b</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfComputerGroupUploader.py</string>
				<key>sha256_hash</key>
				<string>5d0489fd9e664bc80563ba3f74df242746ccd6641985381ab1b2ad310aa373d0</string>
			</dict>
			<key>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</key>
			<dict>
				<key>git_hash</key>
				<string>d1834bfeeba8ff3a9cef947cbbabcf201e65d29b</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPackageUploader.py</string>
				<key>sha256_hash</key>
				<string>e3ca359fe843365a34e5dc542b17d3ad7d57e50a57f2fc36ba0fd43638748d89</string>
			</dict>
			<key>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</key>
			<dict>
				<key>git_hash</key>
				<string>1a4a757f904d39499e93f4a36a3dfa26500b6ae0</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.grahampugh-recipes/JamfUploaderProcessors/JamfPolicyUploader.py</string>
				<key>sha256_hash</key>
				<string>870fb35ce8b024bb14140f896ac7096f3fbc3a7365a5d42d651d66fb57f5ba2c</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.hansen-m.download.zoomus</key>
			<dict>
				<key>git_hash</key>
				<string>e0144f1004d97cd322224a7c4dca5e9930876c69</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.hansen-m-recipes/Zoom/Zoom.download.recipe</string>
				<key>sha256_hash</key>
				<string>e7da9dc87d05caef44c144b4aeb4ff5f9bb71e0036596201a37e864ac6d4bd12</string>
			</dict>
			<key>com.github.homebysix.pkg.Zoom</key>
			<dict>
				<key>git_hash</key>
				<string>3fc6a51644cfa9b791d2ff3ab6434390b073131c</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/Zoom/Zoom.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>016702213ba03e795107961d41e13173c2d5a95476c74ba9f2b596c1c441c9ff</string>
			</dict>
			<key>com.github.novaksam.jamf.Zoom</key>
			<dict>
				<key>git_hash</key>
				<string>0f3b5e131b2d83376b22b3f257a0405c964bb5c2</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.novaksam-recipes/Zoom/Zoom.jamf.recipe</string>
				<key>sha256_hash</key>
				<string>fd3c937fcb0156037ae99233b65f6df707a27b96292e2022b68093829d88037b</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
